# SetWallWidth

## Description
Procedure SetWallWidth sets the default wall width of the document.&lt;BR&gt;

```pascal
PROCEDURE SetWallWidth(widthDistance : REAL (Coordinate));
```

```python

def vs.SetWallWidth(widthDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widthDistance|REAL (Coordinate)|New default wall width.|

## Version
```diff
- SetWallWidth is obsolete as of VectorWorks12.0
```

Availability: from MiniCAD6.0
## Category
* Objects - Walls